app/views/posts/_login_widget.html.erb

SELECT "posts".* FROM "posts"  ORDER BY "posts"."id" DESC
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY "comments"."id" DESC  [["post_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 1]]
---
		<div class="user-data">
			<p>Posts  <span class="badge"><%= current_user.posts.count %></span></p>
			<p>Comments   <span class="badge"><%= current_user.comments.count %></span></p>