app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [[nil, 4]]
---

					<% @post.comments.reverse_order.each do |comment| %>