app/controllers/comments_controller.rb

	def create
	  post = Post.find(params[:post_id])
	  post.comments.create(comments_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "11111"], ["user_id", 1], ["post_id", 1], ["created_at", "2016-02-06 22:21:08.964367"], ["updated_at", "2016-02-06 22:21:08.964367"]]