app/controllers/posts_controller.rb

	def index
		@posts = Post.all.reverse_order
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."id" DESC

	def create
		@post = Post.new(post_params)
		@post.user = current_user
		if @post.save
---
INSERT INTO "posts" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Test"], ["user_id", 1], ["created_at", "2016-02-06 20:23:03.897769"], ["updated_at", "2016-02-06 20:23:03.897769"]]

	def update
		@post = Post.find(params[:id])
		if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "category" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["category", "Friendship"], ["updated_at", "2016-02-09 12:56:09.949172"], ["id", 2]]